#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
keycloak_realm.lab: Refreshing state... [id=lab]
keycloak_openid_client.proxmox: Refreshing state... [id=174374b8-1ae6-4f12-98cc-305aa1e952cd]
keycloak_oidc_identity_provider.github: Refreshing state... [id=github]
keycloak_openid_user_property_protocol_mapper.proxmox_client_mapper: Refreshing state... [id=a7a68351-fdf0-438b-94d5-3698c456b969]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # keycloak_authentication_bindings.browser_authentication_binding will be created
  + resource "keycloak_authentication_bindings" "browser_authentication_binding" {
      + browser_flow               = "github-flow"
      + client_authentication_flow = (known after apply)
      + direct_grant_flow          = (known after apply)
      + docker_authentication_flow = (known after apply)
      + id                         = (known after apply)
      + realm_id                   = "lab"
      + registration_flow          = (known after apply)
      + reset_credentials_flow     = (known after apply)
    }

  # keycloak_authentication_execution.cookie-execution will be created
  + resource "keycloak_authentication_execution" "cookie-execution" {
      + authenticator     = "auth-cookie"
      + id                = (known after apply)
      + parent_flow_alias = "github-flow"
      + realm_id          = "lab"
      + requirement       = "ALTERNATIVE"
    }

  # keycloak_authentication_execution.gh-execution will be created
  + resource "keycloak_authentication_execution" "gh-execution" {
      + authenticator     = "identity-provider-redirector"
      + id                = (known after apply)
      + parent_flow_alias = "github-flow"
      + realm_id          = "lab"
      + requirement       = "ALTERNATIVE"
    }

  # keycloak_authentication_execution_config.gh-config will be created
  + resource "keycloak_authentication_execution_config" "gh-config" {
      + alias        = "github"
      + config       = {
          + "defaultProvider" = "github"
        }
      + execution_id = (known after apply)
      + id           = (known after apply)
      + realm_id     = "lab"
    }

  # keycloak_authentication_flow.github-flow will be created
  + resource "keycloak_authentication_flow" "github-flow" {
      + alias       = "github-flow"
      + id          = (known after apply)
      + provider_id = "basic-flow"
      + realm_id    = "lab"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @astr0n8t, Action: `pull_request`*